<a href="https://colab.research.google.com/github/stmulugheta/Capstone-Project/blob/main/2_data_manipulation_with_pandas/2_data_manipulation_with_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<table align="left">
  <td>
    <a href="https://colab.research.google.com/github/Nyandwi/machine_learning_complete/blob/main/2_data_manipulation_with_pandas/2_data_manipulation_with_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>
  </td>
  <td>
</table>

*This notebook was created by [Jean de Dieu Nyandwi](https://twitter.com/jeande_d) for the love of machine learning community. For any feedback, errors or suggestion, he can be reached on email (johnjw7084 at gmail dot com), [Twitter](https://twitter.com/jeande_d), or [LinkedIn](https://linkedin.com/in/nyandwi).*

<a name='0'></a>
# Data Manipulation with Pandas

 In this lab, you will learn how to manipulate data with Pandas. Here is an overview:

* [1. Basics of Pandas for data manipulation:](#1)

     * [A. Series and DataFrames](#1-1)
     * [B. Data Indexing and Selection, and Iteration (Add Iteration)](#1-2)
     * [C. Dealing with Missing data](#1-3)
     * [D. Basic operations and Functions](#1-4)
     * [E. Aggregation Methods](#1-5)
     * [F. Groupby](#1-6)
     * [G. Merging, Joining and Concatenate](#1-7)
     * [H. Beyond Dataframes: Working with CSV, and Excel](#1-8)
     
* [2. Real World Exploratory Data Analysis (EDA)](#2)

<a name='1'></a>
## 1. Basics of Pandas for data manipulation

<a name='1-1'></a>
### A. Series and DataFrames

Both series and DataFrames are Pandas Data structures. 

Series is like one dimensional NumPy array with axis labels.

DataFrame is multidimensional NumPy array with labels on rows and columns. 

Working with NumPy, we saw that it supports numeric type data. Pandas on other hand supports whole range of data types, from numeric to strings, etc..

Since we are using python notebook, we do not need to install Pandas. We only just have to import it. 

```
import pandas as pd
```

In [1]:
# importing numpy and pandas

import numpy as np
import pandas as pd

#### Creating Series

Series can be created from a Python list, dictionary, and NumPy array.

In [2]:
# Creating the series from a Python list

num_list = [1,2,3,4,5]

pd.Series(num_list)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
week_days = ['Mon','Tues','Wed','Thur','Fri']

pd.Series(week_days, index=["a", "b", "c", "d", "e"])

a     Mon
b    Tues
c     Wed
d    Thur
e     Fri
dtype: object

Note the data types `int64` and `object`.

In [4]:
# Creating the Series from dictionary 

countries_code = { 1:"United States",
                 91:"India",
                 49:"Germany",
                 86:"China",
                250:"Rwanda"}

pd.Series(countries_code)

1      United States
91             India
49           Germany
86             China
250           Rwanda
dtype: object

In [5]:
d = {1:'a', 2:'b', 3:'c', 4:'d'}
pd.Series(d)

1    a
2    b
3    c
4    d
dtype: object

In [6]:
# Creating the Series from NumPy array
# We peovide the list of indexes
# if we don't provide the indexes, the default indexes are numbers...starts from 0,1,2..

arr = np.array ([1, 2, 3, 4, 5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
pd.Series(arr, index=['a', 'b', 'c', 'd', 'e'])

a    1
b    2
c    3
d    4
e    5
dtype: int64

#### Creating DataFrames

DataFrames are the most used Pandas data structure. It can be created from a dictionary, 2D array, and Series.

In [8]:
# Creating DataFrame from a dictionary

countries = {'Name': ['USA', 'India', 'German', 'Rwanda'], 
             
             'Codes':[1, 91, 49, 250] }

pd.DataFrame(countries)

     Name  Codes
0     USA      1
1   India     91
2  German     49
3  Rwanda    250

In [9]:
# Creating a dataframe from a 2D array
# You pass the list of columns

array_2d = np.array ([[1,2,3], [4,5,6], [7,8,9]])

pd.DataFrame(array_2d, columns = ['column 1', 'column 2', 'column 3'])

   column 1  column 2  column 3
0         1         2         3
1         4         5         6
2         7         8         9

In [10]:
# Creating a dataframe from Pandas series 
# Pass the columns in a list

countries_code = { "United States": 1,
                 "India": 91,
                 "Germany": 49,
                 "China": 86,
                 "Rwanda":250}

pd_series = pd.Series (countries_code)

pd.Series(countries_code)

df = pd.DataFrame(pd_series, columns = ['Codes'])
df

               Codes
United States      1
India             91
Germany           49
China             86
Rwanda           250

In [11]:
# Adding a column
# Number in population are pretty random

df ['Population'] = [100, 450, 575, 5885, 533]

df

               Codes  Population
United States      1         100
India             91         450
Germany           49         575
China             86        5885
Rwanda           250         533

In [12]:
# Removing a column 

df.drop('Population', axis =1)

               Codes
United States      1
India             91
Germany           49
China             86
Rwanda           250

In [13]:
df.columns

Index(['Codes', 'Population'], dtype='object')

In [14]:
df.keys

<bound method NDFrame.keys of                Codes  Population
United States      1         100
India             91         450
Germany           49         575
China             86        5885
Rwanda           250         533>

In [15]:
df.index

Index(['United States', 'India', 'Germany', 'China', 'Rwanda'], dtype='object')

<a name='1-2'></a>
### B. Data Indexing and Selection

Indexing and selection works in both Series and Dataframe.

Because DataFrame is made of Series, let's focus on how to select data in DataFrame.

In [16]:
# Creating DataFrame from a dictionary

countries = {'Name': ['USA', 'India', 'German', 'Rwanda'], 
             
             'Codes':[1, 91, 49, 250] }

df = pd.DataFrame(countries, index=['a', 'b', 'c', 'd'])
df

     Name  Codes
a     USA      1
b   India     91
c  German     49
d  Rwanda    250

In [17]:
df['Name']

a       USA
b     India
c    German
d    Rwanda
Name: Name, dtype: object

In [18]:
df.Name

a       USA
b     India
c    German
d    Rwanda
Name: Name, dtype: object

In [19]:
df ['Codes']

a      1
b     91
c     49
d    250
Name: Codes, dtype: int64

In [20]:
## When you have many columns, columns in list will be selected

df [['Name', 'Codes']]

     Name  Codes
a     USA      1
b   India     91
c  German     49
d  Rwanda    250

In [21]:
# This will return the first two rows
df [0:2]

    Name  Codes
a    USA      1
b  India     91

You can also use `loc` to select data by the label indexes and `iloc` to select by default integer index (or by the position of the row)

In [22]:
df.loc['a']

Name     USA
Codes      1
Name: a, dtype: object

In [23]:
df.loc['b':'d']

     Name  Codes
b   India     91
c  German     49
d  Rwanda    250

In [24]:
df [:'b']

    Name  Codes
a    USA      1
b  India     91

In [25]:
df.iloc[2]

Name     German
Codes        49
Name: c, dtype: object

In [26]:
df.iloc[1:3]

     Name  Codes
b   India     91
c  German     49

In [27]:
df.iloc[2:]

     Name  Codes
c  German     49
d  Rwanda    250

### Conditional Selection

In [28]:
df

     Name  Codes
a     USA      1
b   India     91
c  German     49
d  Rwanda    250

In [29]:
#Let's select a country with code 49

df [df['Codes'] ==49 ]

     Name  Codes
c  German     49

In [30]:
df [df['Codes'] < 250 ]

     Name  Codes
a     USA      1
b   India     91
c  German     49

In [31]:
df [df['Name'] =='USA' ]

  Name  Codes
a  USA      1

In [32]:
# You can use and (&) or (|) for more than conditions
#df [(condition 1) & (condition 2)]

df [(df['Codes'] == 91 ) & (df['Name'] == 'India') ]

    Name  Codes
b  India     91

You can also use `isin()` and `where()` to select data in a series or dataframe.

In [33]:
# isin() return false or true when provided value is included in dataframe
sample_codes_names=[1,3,250, 'USA', 'India', 'England']

df.isin(sample_codes_names)

    Name  Codes
a   True   True
b   True  False
c  False  False
d  False   True

As you can see, it returned `True` wherever a country code or name was found. Otherwise, `False`. You can use a dictinary to match search by columns. A key must be a column and values are passed in list.

In [34]:
sample_codes_names = {'Codes':[1,3,250], 'Name':['USA', 'India', 'England']}

df.isin(sample_codes_names)

    Name  Codes
a   True   True
b   True  False
c  False  False
d  False   True

In [35]:
df2 = pd.DataFrame(np.array ([[1,2,3], [4,5,6], [7,8,9]]), 
                   columns = ['column 1', 'column 2', 'column 3'])

df2

   column 1  column 2  column 3
0         1         2         3
1         4         5         6
2         7         8         9

In [36]:
df2.isin([0,3,4,5,7])

   column 1  column 2  column 3
0     False     False      True
1      True      True     False
2      True     False     False

In [37]:
df2 [df2 > 4]

   column 1  column 2  column 3
0       NaN       NaN       NaN
1       NaN       5.0       6.0
2       7.0       8.0       9.0

In [38]:
df2.where(df2 > 4)

   column 1  column 2  column 3
0       NaN       NaN       NaN
1       NaN       5.0       6.0
2       7.0       8.0       9.0

Where the condition is false, `where` allows you to replace values. In this case, all values less than 4 will be 0.

In [39]:
df2.where(df2 > 4, 0)

   column 1  column 2  column 3
0         0         0         0
1         0         5         6
2         7         8         9

In [40]:
# The above do the same as as 

df2 [df2 >4 ] = 0
df2

   column 1  column 2  column 3
0         1         2         3
1         4         0         0
2         0         0         0

#### Iteration

```
df.items() #Iterate over (column name, Series) pairs.
df.iteritems() Iterate over (column name, Series) pairs.
DataFrame.iterrows() Iterate over DataFrame rows as (index, Series) pairs.
DataFrame.itertuples([index, name]) Iterate over DataFrame rows as namedtuples.
```

<a name='1-3'></a>
### C. Dealing with Missing data

Real world datasets are messy, often with missing values. Pandas replace NaN with missing values by default. NaN stands for not a number. 

Missing values can either be ignored, droped or filled.

In [41]:
# Creating a dataframe

df3 = pd.DataFrame(np.array ([[1,2,3], [4,np.nan,6], [7,np.nan,np.nan]]), 
                   columns = ['column 1', 'column 2', 'column 3'])

#### Checking Missing values

In [42]:
# Recognizing the missing values

df3.isnull()

   column 1  column 2  column 3
0     False     False     False
1     False      True     False
2     False      True      True

In [43]:
# Calculating number of the missing values in each feature

df3.isnull().sum()

column 1    0
column 2    2
column 3    1
dtype: int64

In [44]:
# Recognizng non missig values

df3.notna()

   column 1  column 2  column 3
0      True      True      True
1      True     False      True
2      True     False     False

In [45]:
df3.notna().sum()

column 1    3
column 2    1
column 3    2
dtype: int64

#### Removing the missing values

In [46]:
## Dropping missing values 

df3.dropna()

   column 1  column 2  column 3
0       1.0       2.0       3.0

All rows are deleted because dropna() will remove each row which have missing value.

In [47]:
# you can drop NaNs in specific column(s)

df3['column 3'].dropna()

0    3.0
1    6.0
Name: column 3, dtype: float64

In [48]:
# You can drop data by axis 
# Axis = 1...drop all columns with Nans
# df3.dropna(axis='columns')

df3.dropna(axis=1)

   column 1
0       1.0
1       4.0
2       7.0

In [49]:
# axis = 0...drop all rows with Nans
# df3.dropna(axis='columns') is same 

df3.dropna(axis=0)

   column 1  column 2  column 3
0       1.0       2.0       3.0

#### Filling the missing values

In [50]:
# Filling Missing values

df3.fillna(10)

   column 1  column 2  column 3
0       1.0       2.0       3.0
1       4.0      10.0       6.0
2       7.0      10.0      10.0

In [51]:

df3.fillna('fillme')

   column 1 column 2 column 3
0       1.0        2        3
1       4.0   fillme        6
2       7.0   fillme   fillme

In [52]:
# You can forward fill (ffill) or backward fill(bfill)
# Or fill a current value with previous or next value

df3.fillna(method='ffill')

   column 1  column 2  column 3
0       1.0       2.0       3.0
1       4.0       2.0       6.0
2       7.0       2.0       6.0

In [53]:
# Won't change it because the last values are NaNs, so it backward it

df3.fillna(method='bfill')

   column 1  column 2  column 3
0       1.0       2.0       3.0
1       4.0       NaN       6.0
2       7.0       NaN       NaN

In [54]:
# If we change the axis to columns, you can see that Nans at row 2 and col 2 is backfilled with 6

df3.fillna(method='bfill', axis='columns')

   column 1  column 2  column 3
0       1.0       2.0       3.0
1       4.0       6.0       6.0
2       7.0       NaN       NaN

<a name='1-4'></a>
### D. More Operations and Functions

This section will show the more and most useful functions of Pandas.

In [55]:
df4 = pd.DataFrame({'Product Name':['Shirt','Boot','Bag'], 
              'Order Number':[45,56,64], 
              'Total Quantity':[10,5,9]}, 
              columns = ['Product Name', 'Order Number', 'Total Quantity'])

#### Retrieving basic info about the Dataframe

In [56]:
# Return a summary about the dataframe

df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product Name    3 non-null      object
 1   Order Number    3 non-null      int64
 2   Total Quantity  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes

In [57]:
# Return dataframe columns

df4.columns

Index(['Product Name', 'Order Number', 'Total Quantity'], dtype='object')

In [58]:
# Return dataframe data

df4.keys

<bound method NDFrame.keys of   Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9>

In [59]:
# Return the head of the dataframe ....could make sense if you have long frame
# Choose how many rows you want in head()

df4.head(1)

  Product Name  Order Number  Total Quantity
0        Shirt            45              10

In [60]:
# Return the tail of the dataframe

df4.tail(1)

  Product Name  Order Number  Total Quantity
2          Bag            64               9

In [61]:
# Return NumPy array of the dataframe

df4.values

array([['Shirt', 45, 10],
       ['Boot', 56, 5],
       ['Bag', 64, 9]], dtype=object)

In [62]:
# Return the size

df4.size

9

In [63]:
# Return the shape

df4.shape

(3, 3)

In [64]:
# Return the length of the dataframe

df4.shape

(3, 3)

#### Unique Values

In [65]:
# Return unique values in a given column 

df4['Product Name'].unique()

array(['Shirt', 'Boot', 'Bag'], dtype=object)

In [66]:
# Return a number of unique values
df4['Product Name'].nunique()

3

In [67]:
# Counting the occurence of each value in a column 

df4['Product Name'].value_counts()

Bag      1
Shirt    1
Boot     1
Name: Product Name, dtype: int64

#### Applying a Function to Dataframe

In [68]:
# Double the quantity product

def double_quantity(x):
  return x * x

In [69]:
df4['Total Quantity'].apply(double_quantity)

0    100
1     25
2     81
Name: Total Quantity, dtype: int64

In [70]:
# You can also apply an anonymous function to a dataframe
# Squaring each value in dataframe

df5 = pd.DataFrame([[1,2], [4,5]], columns=['col1', 'col2'])

df5.applymap(lambda x: x**2)

   col1  col2
0     1     4
1    16    25

#### Sorting values in dataframe

In [71]:
# Sort the df4 by the order number

df4.sort_values(['Order Number'])

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9

In [72]:
df4.sort_values(['Order Number'], ascending=False)

  Product Name  Order Number  Total Quantity
2          Bag            64               9
1         Boot            56               5
0        Shirt            45              10

<a name='1-5'></a>
### E. Aggregation Methods

In [73]:
df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9

In [74]:
# summary statistics

df4.describe()

       Order Number  Total Quantity
count      3.000000        3.000000
mean      55.000000        8.000000
std        9.539392        2.645751
min       45.000000        5.000000
25%       50.500000        7.000000
50%       56.000000        9.000000
75%       60.000000        9.500000
max       64.000000       10.000000

In [75]:

df4.describe().transpose()

                count  mean       std   min   25%   50%   75%   max
Order Number      3.0  55.0  9.539392  45.0  50.5  56.0  60.0  64.0
Total Quantity    3.0   8.0  2.645751   5.0   7.0   9.0   9.5  10.0

In [76]:
# Mode of the dataframe
# Mode is the most recurring values

df4['Total Quantity'].mode()

0     5
1     9
2    10
dtype: int64

In [77]:
# The maximum value

df4['Total Quantity'].max()

10

In [78]:
# The minimum value

df4['Total Quantity'].min()

5

In [79]:
# The mean

df4['Total Quantity'].mean()

8.0

In [80]:
# The median value in a dataframe

df4['Total Quantity'].median()

9.0

In [81]:
# Standard deviation

df4['Total Quantity'].std()

2.6457513110645907

In [82]:
# Variance 

df4['Total Quantity'].var()

7.0

In [83]:
# Sum of all values in a column

df4['Total Quantity'].sum()

24

In [84]:
# Product of all values in dataframe

df4['Total Quantity'].prod()

450

<a name='1-6'></a>
### F. Groupby

`Group by` involves splitting data into groups, applying function to each group, and combining the results.

In [85]:
df4 = pd.DataFrame({'Product Name':['Shirt','Boot','Bag', 'Ankle', 'Pullover', 'Boot', 'Ankle', 'Tshirt', 'Shirt'], 
              'Order Number':[45,56,64, 34, 67, 56, 34, 89, 45], 
              'Total Quantity':[10,5,9, 11, 11, 8, 14, 23, 10]}, 
              columns = ['Product Name', 'Order Number', 'Total Quantity'])

In [86]:
df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9
3        Ankle            34              11
4     Pullover            67              11
5         Boot            56               8
6        Ankle            34              14
7       Tshirt            89              23
8        Shirt            45              10

In [87]:
# Let's group the df by product name

df4.groupby('Product Name').mean()

              Order Number  Total Quantity
Product Name
Ankle                 34.0            12.5
Bag                   64.0             9.0
Boot                  56.0             6.5
Pullover              67.0            11.0
Shirt                 45.0            10.0
Tshirt                89.0            23.0

In [88]:
df4.groupby('Product Name').sum()

              Order Number  Total Quantity
Product Name
Ankle                   68              25
Bag                     64               9
Boot                   112              13
Pullover                67              11
Shirt                   90              20
Tshirt                  89              23

In [89]:
df4.groupby('Product Name').min()

              Order Number  Total Quantity
Product Name
Ankle                   34              11
Bag                     64               9
Boot                    56               5
Pullover                67              11
Shirt                   45              10
Tshirt                  89              23

In [90]:
df4.groupby('Product Name').max()

              Order Number  Total Quantity
Product Name
Ankle                   34              14
Bag                     64               9
Boot                    56               8
Pullover                67              11
Shirt                   45              10
Tshirt                  89              23

In [91]:
df4.groupby(['Product Name', 'Order Number']).max()

                           Total Quantity
Product Name Order Number
Ankle        34                        14
Bag          64                         9
Boot         56                         8
Pullover     67                        11
Shirt        45                        10
Tshirt       89                        23

In [92]:
df4.groupby(['Product Name', 'Order Number']).sum()

                           Total Quantity
Product Name Order Number
Ankle        34                        25
Bag          64                         9
Boot         56                        13
Pullover     67                        11
Shirt        45                        20
Tshirt       89                        23

You can also use `aggregation()` after groupby.

In [93]:
df4.groupby('Product Name').aggregate(['min', 'max', 'sum'])

             Order Number          Total Quantity
                      min max  sum            min max sum
Product Name
Ankle                  34  34   68             11  14  25
Bag                    64  64   64              9   9   9
Boot                   56  56  112              5   8  13
Pullover               67  67   67             11  11  11
Shirt                  45  45   90             10  10  20
Tshirt                 89  89   89             23  23  23

<a name='1-7'></a>
### G. Combining Datasets: Concatenating, Joining and Merging

#### Concatenation

In [94]:
# Creating dataframes

df1 = pd.DataFrame({'Col1':['A','B','C'],
                   'Col2':[1,2,3]}, 
                   index=['a','b','c'])

df2 = pd.DataFrame({'Col1':['D','E','F'],
                   'Col2':[4,5,6]}, 
                   index=['d','e','f'])


df3 = pd.DataFrame({'Col1':['G','I','J'],
                   'Col2':[7,8,9]}, 
                   index=['g', 'i','j'])

In [95]:
df1

  Col1  Col2
a    A     1
b    B     2
c    C     3

In [96]:
df2

  Col1  Col2
d    D     4
e    E     5
f    F     6

In [97]:
df3

  Col1  Col2
g    G     7
i    I     8
j    J     9

In [98]:
# Concatenating: Adding one dataset to another

pd.concat([df1, df2, df3])

  Col1  Col2
a    A     1
b    B     2
c    C     3
d    D     4
e    E     5
f    F     6
g    G     7
i    I     8
j    J     9

The default axis is `0`. This is how the combined dataframes will look like if we change the `axis to 1`.

In [99]:
pd.concat([df1, df2, df3], axis=1)

  Col1  Col2 Col1  Col2 Col1  Col2
a    A   1.0  NaN   NaN  NaN   NaN
b    B   2.0  NaN   NaN  NaN   NaN
c    C   3.0  NaN   NaN  NaN   NaN
d  NaN   NaN    D   4.0  NaN   NaN
e  NaN   NaN    E   5.0  NaN   NaN
f  NaN   NaN    F   6.0  NaN   NaN
g  NaN   NaN  NaN   NaN    G   7.0
i  NaN   NaN  NaN   NaN    I   8.0
j  NaN   NaN  NaN   NaN    J   9.0

In [100]:
# We can also use append()

df1.append([df2, df3])

  Col1  Col2
a    A     1
b    B     2
c    C     3
d    D     4
e    E     5
f    F     6
g    G     7
i    I     8
j    J     9

#### Merging

If you have worked with SQL, what `pd.merge()` does may be familiar. It links data from different sources (different features) and you have a control on the structure of the combined dataset.

*Pandas Merge method(`how`): SQL Join Name : Description*



```
* left : LEFT OUTER JOIN : Use keys or columns from left frame only

* right : RIGHT OUTER JOIN : Use keys or columns from right frame only

* outer : FULL OUTER JOIN : Use union of keys or columns from both frames

* inner : INNER JOIN : Use intersection of keys or columns from both frames
```

In [101]:
df1 = pd.DataFrame({'Name': ['Joe', 'Joshua', 'Jeanne', 'David'],
                        'Role': ['Manager', 'Developer', 'Engineer', 'Scientist'],
                     'Role': ['Manager', 'Developer', 'Engineer', 'Scientist']
                    
                    })

df2 = pd.DataFrame({'Name': ['David', 'Joshua', 'Joe', 'Jeanne'],
'Year Hired': [2018, 2017, 2020, 2018]})

df3 = pd.DataFrame({'Name': ['David', 'Joshua', 'Joe', 'Jeanne'],
'No of Leaves': [15, 3, 10, 12]})

In [102]:
df1

     Name       Role
0     Joe    Manager
1  Joshua  Developer
2  Jeanne   Engineer
3   David  Scientist

In [103]:
df2

     Name  Year Hired
0   David        2018
1  Joshua        2017
2     Joe        2020
3  Jeanne        2018

In [104]:
pd.merge(df1, df2)

     Name       Role  Year Hired
0     Joe    Manager        2020
1  Joshua  Developer        2017
2  Jeanne   Engineer        2018
3   David  Scientist        2018

In [105]:
## Let's merge on Role being a key 

pd.merge(df1, df2, how='inner', on="Name")

     Name       Role  Year Hired
0     Joe    Manager        2020
1  Joshua  Developer        2017
2  Jeanne   Engineer        2018
3   David  Scientist        2018

In [106]:
df1 = pd.DataFrame({'col1': ['K0', 'K0', 'K1', 'K2'],
                     'col2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
df2 = pd.DataFrame({'col1': ['K0', 'K1', 'K1', 'K2'],
                               'col2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [107]:
df1

  col1 col2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [108]:
df2

  col1 col2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [109]:
pd.merge(df1, df2, how='inner', on=['col1', 'col2'])

  col1 col2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [110]:
pd.merge(df1, df2, how='outer', on=['col1', 'col2'])

  col1 col2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [111]:
pd.merge(df1, df2, how='left')

  col1 col2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [112]:
pd.merge(df1, df2, how='right')

  col1 col2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

#### Joining

Joining is a simple way to combine columns of two dataframes with different indexes.

In [113]:
df1 = pd.DataFrame({'Col1': ['A', 'B', 'C'],
                     'Col2': [11, 12, 13]},
                      index=['a', 'b', 'c']) 

df2 = pd.DataFrame({'Col3': ['D', 'E', 'F'],
                    'Col4': [14, 14, 16]},
                      index=['a', 'c', 'd'])

In [114]:
df1

  Col1  Col2
a    A    11
b    B    12
c    C    13

In [115]:
df2

  Col3  Col4
a    D    14
c    E    14
d    F    16

In [116]:
df1.join(df2)

  Col1  Col2 Col3  Col4
a    A    11    D  14.0
b    B    12  NaN   NaN
c    C    13    E  14.0

In [117]:
df2.join(df1)

  Col3  Col4 Col1  Col2
a    D    14    A  11.0
c    E    14    C  13.0
d    F    16  NaN   NaN

You can see that with `df.join()`, the alignment of data is on indexes.

In [118]:
df1.join(df2, how='inner')

  Col1  Col2 Col3  Col4
a    A    11    D    14
c    C    13    E    14

In [119]:
df1.join(df2, how='outer')

  Col1  Col2 Col3  Col4
a    A  11.0    D  14.0
b    B  12.0  NaN   NaN
c    C  13.0    E  14.0
d  NaN   NaN    F  16.0

Learn more about Merging, Joining, and Concatenating the Pandas Dataframes [here](https://pandas.pydata.org/docs/user_guide/merging.html).

<a name='1-8'></a>
### H. Beyond Dataframes: Working with CSV and Excel

In this last section of Pandas' fundamentals, we will see how to read real world data with different formats: CSV and Excel

#### CSV and Excel

Let's use california housing dataset.

In [120]:
# Let's download the data 

!curl -O https://raw.githubusercontent.com/nyandwi/public_datasets/master/housing.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 1390k  100 1390k    0     0  1709k      0 --:--:-- --:--:-- --:--:-- 1707k

In [121]:
data = pd.read_csv('housing.csv')

In [122]:
data.head()

   longitude  latitude  ...  median_house_value  ocean_proximity
0    -122.23     37.88  ...            452600.0         NEAR BAY
1    -122.22     37.86  ...            358500.0         NEAR BAY
2    -122.24     37.85  ...            352100.0         NEAR BAY
3    -122.25     37.85  ...            341300.0         NEAR BAY
4    -122.25     37.85  ...            342200.0         NEAR BAY

[5 rows x 10 columns]

In [123]:
type(data)

pandas.core.frame.DataFrame

In [124]:
## Exporting dataframe back to csv

data.to_csv('housing_dataset', index=False)

If you look into the folder sidebar, you can see `Housing Dataset`.

In [125]:
## Exporting CSV to Excel

data.to_excel('housing_excel.xlsx', index=False)

In [126]:
## Reading the Excel file back

excel_data = pd.read_excel('housing_excel.xlsx')

In [127]:

excel_data.head()

   longitude  latitude  ...  median_house_value  ocean_proximity
0    -122.23     37.88  ...              452600         NEAR BAY
1    -122.22     37.86  ...              358500         NEAR BAY
2    -122.24     37.85  ...              352100         NEAR BAY
3    -122.25     37.85  ...              341300         NEAR BAY
4    -122.25     37.85  ...              342200         NEAR BAY

[5 rows x 10 columns]

<a name='2'></a>
## Real World: Exploratory Data Analysis (EDA)

All above was the basics. Let us apply some of these techniques to the real world dataset, `Red wine quality`.

In [128]:
!curl -O https://raw.githubusercontent.com/nyandwi/public_datasets/master/winequality-red.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   98k  100   98k    0     0   238k      0 --:--:-- --:--:-- --:--:--  237k

In [129]:
wine_data = pd.read_csv('winequality-red.csv')

In [130]:
# Displaying the head of the dataset

wine_data.head()

   fixed acidity  volatile acidity  citric acid  ...  sulphates  alcohol  quality
0            7.4              0.70         0.00  ...       0.56      9.4        5
1            7.8              0.88         0.00  ...       0.68      9.8        5
2            7.8              0.76         0.04  ...       0.65      9.8        5
3           11.2              0.28         0.56  ...       0.58      9.8        6
4            7.4              0.70         0.00  ...       0.56      9.4        5

[5 rows x 12 columns]

In [131]:
# Displaying the tail of the dataset

wine_data.tail()

      fixed acidity  volatile acidity  citric acid  ...  sulphates  alcohol  quality
1594            6.2             0.600         0.08  ...       0.58     10.5        5
1595            5.9             0.550         0.10  ...       0.76     11.2        6
1596            6.3             0.510         0.13  ...       0.75     11.0        6
1597            5.9             0.645         0.12  ...       0.71     10.2        5
1598            6.0             0.310         0.47  ...       0.66     11.0        6

[5 rows x 12 columns]

In [132]:
# Displaying summary statistics

wine_data.describe().transpose()

                       count       mean  ...        75%        max
fixed acidity         1599.0   8.319637  ...   9.200000   15.90000
volatile acidity      1599.0   0.527821  ...   0.640000    1.58000
citric acid           1599.0   0.270976  ...   0.420000    1.00000
residual sugar        1599.0   2.538806  ...   2.600000   15.50000
chlorides             1599.0   0.087467  ...   0.090000    0.61100
free sulfur dioxide   1599.0  15.874922  ...  21.000000   72.00000
total sulfur dioxide  1599.0  46.467792  ...  62.000000  289.00000
density               1599.0   0.996747  ...   0.997835    1.00369
pH                    1599.0   3.311113  ...   3.400000    4.01000
sulphates             1599.0   0.658149  ...   0.730000    2.00000
alcohol               1599.0  10.422983  ...  11.100000   14.90000
quality               1599.0   5.636023  ...   6.000000    8.00000

[12 rows x 8 columns]

In [133]:
# Displaying quick information about the dataset 

wine_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1599 entries, 0 to 1598
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   fixed acidity         1599 non-null   float64
 1   volatile acidity      1599 non-null   float64
 2   citric acid           1599 non-null   float64
 3   residual sugar        1599 non-null   float64
 4   chlorides             1599 non-null   float64
 5   free sulfur dioxide   1599 non-null   float64
 6   total sulfur dioxide  1599 non-null   float64
 7   density               1599 non-null   float64
 8   pH                    1599 non-null   float64
 9   sulphates             1599 non-null   float64
 10  alcohol               1599 non-null   float64
 11  quality               1599 non-null   int64
dtypes: float64(11), int64(1)
memory usage: 150.0 KB

In [134]:
# Checking missing values

wine_data.isnull().sum()

fixed acidity           0
volatile acidity        0
citric acid             0
residual sugar          0
chlorides               0
free sulfur dioxide     0
total sulfur dioxide    0
density                 0
pH                      0
sulphates               0
alcohol                 0
quality                 0
dtype: int64

In [135]:
# wine quality range from 0 to 10. The higher the quality value, the good wine is

wine_data['quality'].value_counts()

5    681
6    638
7    199
4     53
8     18
3     10
Name: quality, dtype: int64

In [136]:
wine_data.groupby(['fixed acidity', 'volatile acidity', 'citric acid']).sum()

                                            residual sugar  ...  quality
fixed acidity volatile acidity citric acid                  ...
4.6           0.520            0.15                    2.1  ...        4
4.7           0.600            0.17                    2.3  ...        6
4.9           0.420            0.00                    2.1  ...        7
5.0           0.380            0.01                    1.6  ...        6
              0.400            0.50                    4.3  ...        6
...                                                    ...  ...      ...
15.0          0.210            0.44                    4.4  ...       14
15.5          0.645            0.49                    8.4  ...       10
15.6          0.645            0.49                    4.2  ...        5
              0.685            0.76                    3.7  ...        7
15.9          0.360            0.65                    7.5  ...        5

[1333 rows x 9 columns]

In [137]:
wine_data.groupby(['free sulfur dioxide', 'total sulfur dioxide']).sum()

                                          fixed acidity  ...  quality
free sulfur dioxide total sulfur dioxide                 ...
1.0                 28.0                           18.2  ...       12
                    44.0                            7.9  ...        6
2.0                 45.0                            7.9  ...        6
3.0                 6.0                            33.0  ...       16
                    7.0                            25.8  ...       18
...                                                 ...  ...      ...
55.0                95.0                           20.4  ...       12
57.0                135.0                           5.9  ...        5
66.0                115.0                           6.9  ...        5
68.0                124.0                          13.2  ...       10
72.0                160.0                           5.9  ...        6

[870 rows x 10 columns]

This is the end of the lab that was about using Pandas to manipulate data. Alot of things will make sense when we start to prepare data for machine learning models in the next notebooks.

<a name='0'></a>

### [BACK TO TOP](#0)